Externals/DHL/Notes/CreateShipmentDD_Requeste.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:de="http://de.ws.intraship" xmlns:cis="http://dhl.de/webservice/cisbase">
   <soapenv:Header>
       <cis:Authentification>
          <cis:user>geschaeftskunden_api</cis:user>
          <cis:signature>Dhl_ep_test1</cis:signature>
          <cis:type>0</cis:type>
       </cis:Authentification>
   </soapenv:Header>
   <soapenv:Body>
       <de:CreateShipmentDDRequest>
          <cis:Version>
             <cis:majorRelease>1</cis:majorRelease>
             <cis:minorRelease>0</cis:minorRelease>
          </cis:Version>
          <ShipmentOrder>
             <SequenceNumber>1</SequenceNumber>
             <Shipment>
                <ShipmentDetails>
                   <ProductCode>EPN</ProductCode>
                   <ShipmentDate>2014-10-08</ShipmentDate>
                   <cis:EKP>5000000000</cis:EKP>
                   <Attendance>
                      <cis:partnerID>01</cis:partnerID>
                   </Attendance>
                   <ShipmentItem>
                      <WeightInKG>10</WeightInKG>
                      <LengthInCM>50</LengthInCM>
                      <WidthInCM>30</WidthInCM>
                      <HeightInCM>15</HeightInCM>
                      <PackageType>PK</PackageType>
                   </ShipmentItem>
                </ShipmentDetails>
                <Shipper>
                   <Company>
                      <cis:Company>
                         <cis:name1>Muster Company</cis:name1>
                      </cis:Company>
                   </Company>
                   <Address>
                      <cis:streetName>Leipziger Straße</cis:streetName>
                      <cis:streetNumber>47</cis:streetNumber>
                      <cis:Zip>
                         <cis:germany>10117</cis:germany>
                      </cis:Zip>
                      <cis:city>Berlin</cis:city>
                      <cis:Origin>
                         <cis:countryISOCode>DE</cis:countryISOCode>
                      </cis:Origin>
                   </Address>
                   <Communication>
                      <cis:email>max@muster.de</cis:email>
                      <cis:contactPerson>Max Muster</cis:contactPerson>
                   </Communication>
                </Shipper>
                <Receiver>
                   <Company>
                      <cis:Person>
                         <cis:firstname>Markus</cis:firstname>
                         <cis:lastname>Meier</cis:lastname>
                      </cis:Person>
                   </Company>
                   <Address>
                      <cis:streetName>Marktplatz</cis:streetName>
                      <cis:streetNumber>1</cis:streetNumber>
                      <cis:Zip>
                         <cis:other>70173</cis:other>
                      </cis:Zip>
                      <cis:city>Stuttgart</cis:city>
                      <cis:Origin>
                         <cis:countryISOCode>DE</cis:countryISOCode>
                      </cis:Origin>
                   </Address>
                  <Communication>
                                   <cis:phone>0049-30-763291</cis:phone>
                   </Communication>
                </Receiver>
             </Shipment>
          </ShipmentOrder>
       </de:CreateShipmentDDRequest>
   </soapenv:Body>
</soapenv:Envelope>